CREATE TABLE `todo` (
  `no` int NOT NULL AUTO_INCREMENT,
  `name` text NOT NULL,
  `status` int DEFAULT '0',
  `reg_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `upd_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`no`)
) COMMENT='할일';

INSERT INTO `todo` (`name`, `status`, `reg_date`, `upd_date`) VALUES
('프로젝트 보고서 작성', 0, '2023-06-01 10:00:00', '2023-06-01 10:00:00'),
('식료품 구매', 1, '2023-06-02 11:00:00', '2023-06-02 11:00:00'),
('클라이언트 회의 일정 잡기', 0, '2023-06-03 12:00:00', '2023-06-03 12:00:00'),
('전기요금 납부', 1, '2023-06-04 13:00:00', '2023-06-04 13:00:00'),
('세금 서류 제출', 0, '2023-06-05 14:00:00', '2023-06-05 14:00:00'),
('집 청소', 1, '2023-06-06 15:00:00', '2023-06-06 15:00:00'),
('프레젠테이션 준비', 0, '2023-06-07 16:00:00', '2023-06-07 16:00:00'),
('요가 수업 참석', 1, '2023-06-08 17:00:00', '2023-06-08 17:00:00'),
('자동차 수리', 0, '2023-06-09 18:00:00', '2023-06-09 18:00:00'),
('치과 방문', 1, '2023-06-10 19:00:00', '2023-06-10 19:00:00');


SELECT * FROM todo;

UPDATE todo set status=1 where no=3;